In [21]:
import pandas as pd

loan_total = pd.DataFrame({"ln_no":['10001', '10001', '10001', '10001', '10001','10002', '10002', '10002', '10002', '10002'],
                         "check_date":["20171021","20171121","20171221","20180121","20180221"]*2,
                         "yuqi_status":["M1","C","M1","M2","C","M1","C","M1","C","C"],
                         "yue":[10000,9900,9900,9900,9700,50000,49900,49900,49800,49700]})

In [22]:
loan_total

  check_date  ln_no    yue yuqi_status
0   20171021  10001  10000          M1
1   20171121  10001   9900           C
2   20171221  10001   9900          M1
3   20180121  10001   9900          M2
4   20180221  10001   9700           C
5   20171021  10002  50000          M1
6   20171121  10002  49900           C
7   20171221  10002  49900          M1
8   20180121  10002  49800           C
9   20180221  10002  49700           C

In [23]:
loan_total.loc[:,'yuqi_shift'] = loan_total['yuqi_status'].shift(1)
loan_total.loc[:,'yuqi_combine'] = loan_total['yuqi_shift']+"_"+loan_total['yuqi_status']
loan_total.loc[:,'yue_shift'] = loan_total['yue'].shift(1)
loan_total.dropna(inplace=True)
rule = (loan_total.yuqi_combine.str.contains("_C"))&(loan_total.yuqi_combine.str.contains("M"))
loan_result = loan_total.loc[rule,:][['ln_no','check_date','yuqi_combine','yue_shift']]

In [26]:
loan_result

   ln_no
1  10001
4  10001
6  10002
8  10002